package Hw2

import java.text.NumberFormat

//Визначте, чи є заданий рік високосним.
//
//Рік є високосним, якщо він ділиться на 4, але не ділиться на 100, якщо тільки він також не ділиться на 400.
//
//Вхідні дані
//Вхід містить одне ціле число N, де 0≤N≤9999, що означає рік.
//
//Вихідні дані
//Виведіть YES, якщо рік є високосним, інакше виведіть NO.
//
//Приклади
//Приклад 1
//
//Вхідні дані
//4
//Вихідні дані
//YES


fun main() {
    val year = readln().toInt()

    if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0)) {
        println("YES")
    } else {
        println("NO")
    }
}